// main.html 메뉴 관련 데이터 JS - mdata.js //
const mdata01 = {
    "마을공동체 활성화 지원사업": [
        "중흥3동 주민자치위원회",
        "신안동 주민자치위원회",
        "용봉동 주민자치회",
        "운암3동 주민자치회(1)",
        "운암3동 주민자치회(2)",
        "문화동 주민자치회",
        "문흥1동 주민자치회(1)",
        "문흥1동 주민자치회(2)",
        "두암3동 주민자치위원회",
        "석곡동 주민자치위원회",
        "양산동 주민자치회",
        "중흥2동 몸맘살림",
        "중흥2동 쓰담쓰담 예술나눔",
        "신안동 빛고을 공예 협동조합",
        "용봉동 용봉마을 연극단",
        "운암1동 벽산블루밍 운암메가씨티3단지",
        "운암1동 벽산블루밍1단지 마을여성회",
        "운암2동 365민생행복지원단",
        "동림동 행복한 공동체 모다",
        "동림동 동림동 지역사회 보장협의체",
        "우산동 기마전 아트공동체",
        "우산동 꿈나무 사회복지관",
        "풍향동 코리아 문화예술단",
        "문화동 각화 종합사회복지관",
        "문흥2동 문흥 골목대장",
        "두암3동 두암 종합사회복지관",
        "두암3동 무등 종합사회복지관",
        "오치1동 오치 종합사회복지관",
        "오치1동 대금연주단 여울림",
        "석곡동 원시인마을",
        "석곡동 월산 마을번영회",
        "양산동 교육네트워크 희망팩토리",
        "양산동 연제 주공아파트관리소",
        "양산동 JS뮤지션스그룹",
        "신용동 신용동 지역사회 보장협의체",
        "신용동 꿈틀어린이 작은도서관",
        "북구 동운마을 기후환경 연합공동체'이음'",
        "북구 광주북구 문화예술연합",
        "북구 북구 마을네트워크"
    ],
    "마을모임 지원사업": [
        "중흥2동 광주역 다사로움 아파트",
        "용봉동 비건 어게인",
        "용봉동 광주5·18 청소년 오케스트라",
        "운암1동 대주아파트 입주자 대표회의",
        "운암1동 운암 빛고을 봉사단",
        "운암2동 글로벌 노르딕 워킹협회",
        "동림동 그린뉴딜 공동체 우아미",
        "동림동 친수마을 사랑수레",
        "동림동 동림주공2차 경로당",
        "우산동 우산3사랑회",
        "문화동 각화사랑회",
        "문흥1동 아파트 자치회연합회",
        "두암2동 두암동무등파크",
        "두암2동 해성숲사랑",
        "오치1동 자연드러와",
        "오치1동 국제공예문화 총연합회 광주지부",
        "오치2동 올치오치",
        "양산동 광주샛별마을 공동체"
    ],
    "광주형 협치마을 모델사업": [
        "운암1동 해오름 마을공동체",
        "오치1동 주민협의체",
        "오치2동 주민자치위원회",
        "석곡무등산 마을협의회"
    ]
}; // mdata01 //

const mdata02 = {
    "洞 마을의제 실행력 제고 워크숍": [
        "운암권역",
        "문화권역",
        "일곡권역",
        "용봉권역",
        "두암권역",
        "중흥권역"
    ],
    "분야별 성장지원 워크숍": [
        "마을복지",
        "기후환경",
        "문화예술·도시재생"
    ],
    "사회적 경제기반 교육": [
        "사회적 경제 이해",
        "정부 사업에 대한 이해",
        "마을 자원 발굴",
        "마을 자원 연계 사회적 경제 모델 구축",
        "마을 내 경제 조직 구성",
        "서류 작성 및 준비 Ⅰ",
        "서류 작성 및 준비 Ⅱ"
    ],
    "마을환경 실천활동가 양성교육": [
        "생활 속 탄소중립 실천마을",
        "자원순환 마을 만들기",
        "환경기초시설 견학",
        "생활 속 업사이클링 아트마을",
        "마을 속 도시농업",
        "수료식"
    ],
    "마을미디어 주민활동가 양성교육": [
        "마을미디어 콘텐츠 이해",
        "기획 및 촬연",
        "녹화 및 편집",
        "편집 및 업로드",
        "360 VR 사진촬영을 활용한 마을 아카이브",
        "3D 사진촬영을 활용한 마을 아카이브",
        "메타버스를 활용한 마을 아카이브"
    ]
}; // mdata02 //

const mdata03 = {
    "북구마을 분쟁해결 지원센터": [
        "북구마을 분쟁해결 지원센터"
    ],
    "소통방": [
        "임동 세대공감",
        "신안동 징검다리",
        "용봉동 두루모아",
        "용봉동 아름다운 화해",
        "운암1동 이심(⼼)전심(⼼)",
        "동림동 오손도손 사랑방",
        "삼각동 들樂날樂",
        "일곡동 행복나눔 사랑방",
        "오치1동 한울타리",
        "오치2동 오치골"
    ]
}; // mdata03 //

const mdata04 = {
    "찾아가는 어린이 환경리더 교육": [
        "효동 초등학교",
        "용주 초등학교"
    ],
    "마을활동가 토크쇼": [
        "마을활동가 토크쇼"
    ],
    "탄소중립 그린마을 동행": [
        "탄소중립 그린마을 동행"
    ]
}; // mdata04 //

// .gnbT에서 어떤 목록을 눌렀는지에 따라 실행되는 동영상이나 .gnbL목록, 이미지 등을 담은 배열
let click_data = {
    "마을 공동체": [
        mdata01,
        "blue_bg02",
        "./video/1A01.mp4",
        "./video/1B01.mp4",
        "./video/1C01.mp4"
    ],
    "미래 학교": [
        mdata02,
        "blue_bg03",
        "./video/2A01.mp4",
        "./video/2A07.mp4",
        "./video/2B01.mp4",
        "./video/2C01.mp4",
        "./video/2C07.mp4"
    ],
    "마을 분쟁 해결 지원센터": [
        mdata03,
        "blue_bg04",
        "./video/3A01.mp4",
        "./video/3B01.mp4",
    ],
    "부록": [
        mdata04,
        "blue_bg05",
        "./video/4A01.mp4",
        "./video/4B01.mp4",
        "./video/4C01.mp4"
    ]
}; // click_data //