// main.html 메뉴 관련 데이터 JS - mdata.js //

// .gnb의 각 메뉴마다 가지는 고유 데이터
const mdata01 = {
    "마을공동체 활성화 지원사업": {
        "중흥3동주민자치위원회":[],
        "신안동주민자치위원회":[],
        "용봉동주민자치회":[],
        "운암3동주민자치회(1)":[],
        "운암3동주민자치회(2)":[],
        "문화동주민자치회":[],
        "문화동주민자치회":[],
        "문흥1동주민자치회(1)":[],
        "문흥1동주민자치회(2)":[],
        "두암3동주민자치위원회":[],
        "석곡동주민자치위원회":[],
        "양산동주민자치회":[],
        "중흥2동_몸맘살림":[],
        "중흥2동_쓰담쓰담 예술나눔":[],
        "신안동_빛고을공예협동조합":[],
        "용봉동_용봉마을연극단":[],
        "운암1동_벽산블루밍 운암메가씨티3단지":[],
        "운암1동_벽산블루밍1단지 마을여성회":[],
        "운암2동_운암2동 365민생행복지원단":[],
        "동림동_행복한공동체 모다":[],
        "동림동_동림동지역사회보장협의체":[],
        "우산동_기마전아트공동체":[],
        "우산동_꿈나무사회복지관":[],
        "풍향동_코리아문화예술단":[],
        "문화동_각화종합사회복지관":[],
        "문흥2동_문흥골목대장":[],
        "두암3동_두암종합사회복지관":[],
        "두암3동_무등종합사회복지관":[],
        "오치1동_오치종합사회복지관":[],
        "오치1동_대금연주단 여울림":[],
        "석곡동_원시인마을":[],
        "석곡동_월산마을번영회":[],
        "양산동_교육네트워크희망팩토리":[],
        "양산동_연제주공아파트관리소":[],
        "양산동_JS뮤지션스그룹":[],
        "신용동_신용동지역사회보장협의체":[],
        "신용동_꿈틀어린이작은도서관":[],
        "북구_동운마을기후환경연합공동체'이음'":[],
        "북구_광주북구문화예술연합":[],
        "북구_북구마을네트워크":[]
    },
    "마을모임 지원사업": {
        "중흥2동_광주역다사로움아파트":[],
        "용봉동_비건어게인":[],
        "용봉동_광주5·18청소년오케스트라":[],
        "운암1동_대주아파트입주자대표회의":[],
        "운암1동_운암 빛고을 봉사단":[],
        "운암2동_글로벌노르딕워킹협회":[],
        "동림동_그린뉴딜 공동체 우아미":[],
        "동림동_친수마을사랑수레":[],
        "동림동_동림주공2차경로당":[],
        "우산동_우산3사랑회":[],
        "문화동_각화사랑회":[],
        "문흥1동_문흥1동아파트자치회연합회":[],
        "두암2동 두암동무등파크":[],
        "두암2동_해성숲사랑":[],
        "오치1동_자연드러와":[],
        "오치1동_국제공예문화총연합회 광주지부":[],
        "오치2동_올치오치":[],
        "양산동_광주샛별마을공동체":[]
    },
    "광주형 협치마을 모델사업": {
        "운암1동해오름마을공동체":[],
        "오치1동주민협의체":[],
        "오치2동주민자치위원회":[],
        "석곡무등산마을협의회":[]
    }
}; // mdata01 //

const mdata02 = {
    "洞 마을의제 실행력 제고 워크숍": {
        "운암권역":[],
        "문화권역":[],
        "일곡권역":[],
        "용봉권역":[],
        "두암권역":[],
        "중흥권역":[]
    },
    "분야별 성장지원 워크숍": {
        "마을복지":[],
        "기후환경":[],
        "문화예술·도시재생":[]
    },
    "사회적 경제 기반 교육": {
        "사회적 경제 이해":[],
        "정부 사업에 대한 이해":[],
        "마을 자원 발굴":[],
        "마을 자원 연계 사회적 경제 모델 구축":[],
        "마을 내 경제 조직 구성":[],
        "서류 작성 및 준비 Ⅰ":[],
        "서류 작성 및 준비 Ⅱ":[]
    },
    "마을환경 실천활동가 양성교육": {
        "생활 속 탄소중립 실천마을":[],
        "자원순환 마을 만들기":[],
        "환경기초시설 견학":[],
        "생활 속 업사이클링 아트마을":[],
        "마을 속 도시농업":[],
        "수료식":[]
    },
    "마을미디어 주민활동가 양성교육": {
        "마을미디어 콘텐츠 이해":[],
        "기획 및 촬연":[],
        "녹화 및 편집":[],
        "편집 및 업로드":[],
        "360 VR 사진촬영을 활용한 마을 아카이브":[],
        "3D 사진촬영을 활용한 마을 아카이브":[],
        "메타버스를 활용한 마을 아카이브":[]
    }
}; // mdata02 //

const mdata03 = {
    "북구마을 분쟁해결 지원센터": {
        "북구마을 분쟁해결 지원센터":[]
    },
    "소통방": {
        "임동 세대공감":[],
        "신안동 징검다리":[],
        "용봉동 두루모아":[],
        "용봉동 아름다운 화해":[],
        "운암1동 이심(⼼)전심(⼼)":[],
        "동림동 오손도손 사랑방":[],
        "삼각동 들樂날樂":[],
        "일곡동 행복나눔 사랑방":[],
        "오치1동 한울타리":[],
        "오치2동 오치골":[]
    }
}; // mdata03 //

const mdata04 = {
    "찾아가는 어린이 환경리더 교육": {
        "효동초등학교":[],
        "용주초등학교":[]
    },
    "마을활동가 토크쇼": {
        "마을활동가 토크쇼":[]
    },
    "탄소중립 그린마을 동행": {
        "탄소중립 그린마을 동행":[]
    }
}; // mdata04 //
const mdata05 = {
    "찾아가는 어린이 환경리더 교육": [
        "효동초등학교",
        "용주초등학교"
    ],
    "마을활동가 토크쇼": {
        "마을활동가 토크쇼":[]
    },
    "탄소중립 그린마을 동행": {
        "탄소중립 그린마을 동행":[]
    }
}; // mdata04 //

// .gnb에서 누른 목록에 따라 실행되는 동영상이나 좌측 목록, 배경색 등을 담은 배열
let sdata = {
    마을공동체: {
        동영상: "./video/1A01.mp4",
        사이드메뉴: mdata01,
        배경색: "blue_bg01"
    },
    마을공동체활성화지원사업: {
        동영상: "./video/1A01.mp4",
        사이드메뉴: mdata01,
        배경색: "blue_bg01"
    },
    마을모임지원사업: {
        동영상: "./video/1B01.mp4",
        사이드메뉴: mdata01,
        배경색: "blue_bg01"
    },
    광주형협치마을모델사업: {
        동영상: "./video/1C01.mp4",
        사이드메뉴: mdata01,
        배경색: "blue_bg01"
    },
    미래학교: {
        동영상: "./video/2A01.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    洞마을의제실행력제고워크숍: {
        동영상: "./video/2A01.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    분야별성장지원워크숍: {
        동영상: "./video/2A07.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    사회적경제기반교육: {
        동영상: "./video/2B01.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    마을환경실천활동가양성교육: {
        동영상: "./video/2C01.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    마을미디어주민활동가양성교육: {
        동영상: "./video/2C07.mp4",
        사이드메뉴: mdata02,
        배경색: "blue_bg02"
    },
    마을분쟁해결지원센터: {
        동영상: "./video/3A01.mp4",
        사이드메뉴: mdata03,
        배경색: "blue_bg03"
    },
    북구마을분쟁해결지원센터: {
        동영상: "./video/3A01.mp4",
        사이드메뉴: mdata03,
        배경색: "blue_bg03"
    },
    소통방: {
        동영상: "./video/3B01.mp4",
        사이드메뉴: mdata03,
        배경색: "blue_bg03"
    },
    부록: {
        동영상: "./video/4A01.mp4",
        사이드메뉴: mdata04,
        배경색: "blue_bg04"
    },
    찾아가는어린이환경리더교육: {
        동영상: "./video/4A01.mp4",
        사이드메뉴: mdata04,
        배경색: "blue_bg04"
    },
    마을활동가토크쇼: {
        동영상: "./video/4B01.mp4",
        사이드메뉴: mdata04,
        배경색: "blue_bg04"
    },
    탄소중립그린마을동행: {
        동영상: "./video/4C01.mp4",
        사이드메뉴: mdata04,
        배경색: "blue_bg04"
    }
}; // sdata //